using Entity.Persons;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Repository
{
    /// <summary>
    /// <see cref="People"/>エンティティのリポジトリ
    /// </summary>
    public class PeopleRepository : IGetPersonsRepository
    {
        #region Constants -------------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Fields ----------------------------------------------------------------------------------------

        private People _people;

        #endregion --------------------------------------------------------------------------------------------

        #region Properties ------------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Events ----------------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Constructor -----------------------------------------------------------------------------------

        /// <summary>
        /// コンストラクタ
        /// </summary>
        public PeopleRepository()
        {
            _people = new People();
        }

        #endregion --------------------------------------------------------------------------------------------

        #region Methods ---------------------------------------------------------------------------------------

        #region Methods - public ------------------------------------------------------------------------------

        /// <summary>
        /// <see cref="People"/>エンティティの複製を取得します。
        /// </summary>
        /// <returns>Peopleエンティティの複製インスタンス</returns>
        public People LoadPeople() => _people;

        /// <summary>
        /// <see cref="People"/>エンティティを保存します。
        /// </summary>
        /// <param name="people">Peopleエンティティ</param>
        public void SavePeople(People people)
        {
            _people = people;
        }

        /// <inheritdoc/>
        public IGetPersons LoadPersonsGetter() => _people;

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - protected ---------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - private -----------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #region Methods - override ----------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------

        #endregion --------------------------------------------------------------------------------------------
    }
}
